<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest CertAid and builds a package</string>
    <key>Identifier</key>
    <string>com.github.umeditor.download.CertAid</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>CertAid</string>
      <key>DOWNLOAD_URL</key>
      <string>https://ist.mit.edu/certaid/mac/recommended</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>re_pattern</key>
                <string>(http://downloads.mit.edu/released/certaid/latest/CertAid.zip)</string>
                <key>result_output_var_name</key>
                <string>url</string>
              </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
    </array>
</dict>
</plist>
